backend/app/controllers/api/v1/appointments_controller.rb

      def index
        appointments = Appointment.includes(:doctor, :patient).all
---
SELECT "appointments".* FROM "appointments"
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" IN (7, 8)
SELECT "patients".* FROM "patients" WHERE "patients"."id" IN (5, 6)

      def create
        appointment = Appointment.new(appointment_params)
        if appointment.save
---
INSERT INTO "appointments" ("doctor_id", "patient_id", "appointment_date", "created_at", "updated_at") VALUES (4, 3, '2025-12-25 10:00:00', '2025-11-21 08:36:12.582126', '2025-11-21 08:36:12.582126') RETURNING "id"