backend/app/controllers/api/v1/doctors_controller.rb

SELECT "doctors".* FROM "doctors"
---
      def index
        doctors = Doctor.all