backend/app/controllers/api/v1/patients_controller.rb

      def index
        patients = Patient.all
---
SELECT "patients".* FROM "patients"